ЛАБОРАТОРНАЯ РАБОТА №5 - "СОПРОЦЕССОР."
ЦЕЛЬ РАБОТЫ:
1) Вычислить заданное вещественное выражение для исходных данных в
форматах Float для переменных a и b и Int - все остальные переменные),
используя арифметические операции сопроцессора
2) Научиться использовать подпрограммы
Программа должна быть написана целиком на языке Ассемблера.
Исходные значения переменных вводятся пользователем с клавиатуры. Они
должны быть максимально приближены к максимально-возможным для тех
типов данных, с которыми решается задача. При вводе данных
рекомендуется вывести диапазон возможных значений. Размер и тип
числителя, знаменателя и результата зависит от заданного выражения.
ПОРЯДОК РАБОТЫ:
 Внимательно изучить свой вариант арифметического выражения;
 Реализовать ввод данных с консоли;
 Реализовать вычисление выражения в виде трех подпрограмм
(функций):
o Функция вычисления числителя;
o Функция вычисления знаменателя;
o Функция вычисления результирующего выражения.
 Результат вычисления числителя и знаменателя должен быть сохранен
как локальные переменные.
 Параметры в функции передаются через стек. Возвращение результата
через регистр.
 Вывести на экран числитель, знаменатель и результат.
Си-аналог задачи:
float result(float a, float b, int c) {
 float num = numenator (a, b);
 float denom = denomenator (b, c);
 float res = num/denom;
printf(“n= %f, d = %f, res = %f\n”, num, denom, res);
}


Вариант 22:
(1+7*b/2)/(a+b*2/d)